package Study;
//interface에서 실수로 class로 바꿔도 다시 interface로 치면 돌아간다.
//interface는 class와 동일하게 첫글자를 대문자로 작성!
//클래스의 구성요소(작성할 수 있는거) : 멤버변수, 메서드의 정의, 생성자
//인터페이스의 구성요소 : 추상메서드
public interface Print {
  //이 메서드를 호출하면 프린트가 나온다.
  //인터페이스를 일종의 공문서라고 생각하고 이 공문서대로 메서드를 만들어야한다.
  //인터페이스 20% + 메서드 80%
  //인터페이스는 클래스를 위한 설계도, 클래스에 얹혀살아야한다.
  //클래스는 제품이고 인터페이스는 인증마크같아서 혼자서는 아무 의미가 없다.
  //메서드의 정의는 있지만, 내용부가 없는 메서드를 '추상 메서드'라고 부름

  //흑백 출력 기능
  public void print();

  //컬러 출력 기능
  public void colorPrint();

}
