/*
* 반복문(while, for)
* 특정 코드를 원하는 횟수만큼 반복적으로 실행하는 코드
* 반복 조건이 맞는 동안,
*
* 반복 시작 조건;
* while(반복 조건){
* 반복 실행할 코드 -> 여러줄 삽입 가능
* 반복 실행할 코드 -> 여기 들어가는 내용을 출력
* 반복을 파기할 조건
* }
*
* */

public class While_1 {
  public static void main(String[] args) {

    int num = 0; //반복 시작 조건; -> 무조건 있어야 함 반복 조건 이전에 시작조건을 줘야함 항상 먼저!
    //대부분의 경우 컴퓨터 프로그래밍에서는 "0"부터 시작한다.
    //num이 3보다 작을 동안 반복하겠다.
    while (num < 3) { //반복 조건
      System.out.println("java");
      num++; // 반복을 파기할 조건 -> 위치는 상단 하단 무관함 위치 선정에 따라 결과는 달라질 수 있음 통상적으로 마지막에 넣는다.

    }


    //변수, 자료형, 연산자, 조건문(if), 반복문 -> 매일 사용
  }
}
