package study;

//배열의 선언과 생성 방법
public class Array_1 {
  public static void main(String[] args) {
    //기본 자료형 8개-boolean byte short int long char float double 모두 소문자,
    //문자 자료형 String 은 대문자
    //자료형은 모두 각각의 배열 형성 -> int와 int배열은 같은 자료형이 아니다.

    //배열의 기본 형태
    //정수를 저장할 공간 5개를 생성 - 같은 자료형만 가능 int -> int
    int[] a = new int[5];

    /// ////////////////////////////////////////////////////////////////////

    //배열 사용을 위한 조건
    //1. 배열을 선언
    // -자료형[] 변수명(참조변수);  -> 변수와 선언에서 다른점은 대괄호가 자료형 뒤에 들어간다.
    // ex) int[] aaa;
    // ex) double[] bbb;
    //2. 배열을 생성한다(변수에서는 초기화라고 부름)
    // - 참조변수명(배열의 변수명) = new 자료형[공간의 크기];
    // 공간의 크기는 배열 생성 시 결정하며, 한 번 크기가 정해지면 수정불가!
    // ex) aaa = new int[3]; -> 정수를 저장할 공간 3개를 생성 -> 절대 수정 불가! 추가로 새로 만들어야함
    // ex) bbb = new double[5] -> 실수를 저장할 공간 5개를 생성

    //정수를 다수 저장할 수 잇는 배열 arr1을 선언하세요.
    int[] arr1;
    //arr1 배열을 정수가 5개 저장될 수 있도록 생성하세요.
    arr1 = new int[5];

    // 문자열 다수 저장할 수 있는 배열 arr2 선언
    String[] arr2;
    //arr2 배열을 문자열이 4개 저장될 수 있도록 생성
    arr2 = new String[4];

    //배열의 선언 및 생성을 동시 진행
    //실수를 5개 저장할 수 있는 배열 arr3를 생성
    double[] arr3 = new double[5];


  }
}
