package study;

//배열 생성 추가 내용 및 또 다른 배열 생성 방법
public class Array_2 {
  public static void main(String[] args) {
    //정수를 3개 저장할 수 있는 배열 arr1 생성
    //정수형 배열을 생성하면 모든 공간은 "0"으로 초기화 되어있다.
    int[] arr1 = new int[3];

    //실수를 5개 저장할 수 있는 배열 arr2를 생성
    //실수형 배열을 생성하면 모든 공간은 "0.0"으로 초기화 된다.
    double[] arr2 = new double[5];

    //문자형 String 배열은 생성하면 null로 초기화된다.
    //null : 아직 값이 정해지지 않음

    //boolean 배열을 생성하면 false로 초기화된다.

    //배열의 또 다른 생성 방법(실무에서 잘 사용하지 않음)
    //배열의 생성과 동시에 특장 값으로 초기화 하는 방법

    //정수 1,3,5로 초기화된 배열 생성
    int[] arr3 = {1, 3, 5};

    //특정 값으로 초기화 시키는 생성 방법은 선언 및 생성을 별도로 진행할 수 없다.
    int[] arr6;
    // arr6 = {1, 3, 5}; //-> 이런 방식으로는 진행 불가능, 오류발생!!

    //문자열 "java", "c++", "python"으로 초기화된 배열 생성
    String[] arr4 = {"java", "c++", "python"};

    //실수형 배열
    double[] arr5 = {1.1, 2.2, 3.3, 4.4};




  }
}
